app/Controllers/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `students`
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `status` = 'rejected'
---
    public function index()
    {
        $studentModel = new \App\Models\StudentModel();
        $auditModel   = new \App\Models\AuditLogModel();
        $certModel    = new \App\Models\CertificateModel();

        // 📊 Stats Aggregation
        $data['total_students'] = $studentModel->countAllResults();
        $data['pending_apps']   = $studentModel->where('status', 'pending')->countAllResults();
        $data['approved_apps']  = $studentModel->where('status', 'approved')->countAllResults();
        $data['rejected_apps']  = $studentModel->where('status', 'rejected')->countAllResults();