app/Controllers/StudentController.php

    public function index()
    {
        $model = new StudentModel();

        $db = \Config\Database::connect();
        if (!$db->fieldExists('updated_at', 'students')) {
            $db->query("ALTER TABLE students ADD updated_at DATETIME DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP");
            // Set existing records to current time so they aren't completely null initially
            $db->query("UPDATE students SET updated_at = CURRENT_TIMESTAMP WHERE updated_at IS NULL");
        }

        // Sorting by updated_at DESC (which will show the latest edited or added records first)
        $data['students'] = $model->orderBy('updated_at', 'DESC')->orderBy('id', 'DESC')->findAll();

        // Stats
        $data['total_students'] = count($data['students']);
        $data['pending_count'] = $model->where('status', 'pending')->countAllResults();
        $data['approved_count'] = $model->where('status', 'approved')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `status` = 'approved'

    public function view($id)
    {
        $studentModel = new StudentModel();
        $certificateModel = new CertificateModel();

        $data['student'] = $studentModel->find($id);
        if (!$data['student']) {
            return redirect()->to('/students');
        }

        $data['certificates'] = $certificateModel->where('student_id', $id)->findAll();
---
SELECT *
FROM `certificates`
WHERE `student_id` = '2'