app/Controllers/StudentController.php

SELECT *
FROM `students`
ORDER BY `updated_at` DESC, `id` DESC
---
    public function index()
    {
        $model = new StudentModel();

        $db = \Config\Database::connect();
        if (!$db->fieldExists('updated_at', 'students')) {
            $db->query("ALTER TABLE students ADD updated_at DATETIME DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP");
            // Set existing records to current time so they aren't completely null initially
            $db->query("UPDATE students SET updated_at = CURRENT_TIMESTAMP WHERE updated_at IS NULL");
        }

        // Sorting by updated_at DESC (which will show the latest edited or added records first)
        $data['students'] = $model->orderBy('updated_at', 'DESC')->orderBy('id', 'DESC')->findAll();

INSERT INTO `students` (`name`, `email`, `phone`, `department`, `profile_photo`, `resume`, `id_proof`, `signature`) VALUES ('vimal R', 'vimal@gmail.com', '6383456669', 'Mechanical Engineering', '1774858168_af6248c3ffaa50e9ab64.png', '1774858168_ea7154df301ab8845ae5.pdf', '1774858168_65a8db4705b3edb7a4e7.jpeg', '69ca2fb83b73e.png')
---
            'signature' => $signatureName,
        ];

        $studentModel->insert($studentData);

INSERT INTO `certificates` (`student_id`, `file_name`) VALUES (4, '1774858168_f8f82f30af0704ae2e99.jpeg')
---
                $fileName = $file->getRandomName();
                $file->move('uploads/certificates/', $fileName);

                $certificateModel->insert([
                    'student_id' => $studentId,
                    'file_name' => $fileName
                ]);

SELECT *
FROM `students`
WHERE `students`.`id` = '4'
SELECT *
FROM `certificates`
WHERE `student_id` = '4'
---
    public function view($id)
    {
        $studentModel = new StudentModel();
        $certificateModel = new CertificateModel();

        $data['student'] = $studentModel->find($id);
        if (!$data['student']) {
            return redirect()->to('/students');
        }

        $data['certificates'] = $certificateModel->where('student_id', $id)->findAll();

SELECT *
FROM `students`
WHERE `students`.`id` = '2'
SELECT *
FROM `certificates`
WHERE `student_id` = '2'
---
    public function edit($id)
    {
        $studentModel = new StudentModel();

        $data['student'] = $studentModel->find($id);
        if (!$data['student']) {
            return redirect()->to('/students');
        }

        $certificateModel = new CertificateModel();
        $data['certificates'] = $certificateModel->where('student_id', $id)->findAll();

SELECT *
FROM `students`
WHERE `students`.`id` = '2'
---
    public function update($id)
    {
        $studentModel = new StudentModel();
        $certificateModel = new CertificateModel();

        $student = $studentModel->find($id);

UPDATE `students` SET `name` = 'Duize DS', `email` = 'stanger@gmail.com', `phone` = '95463 52626', `department` = 'Information Technology', `signature` = '69ca2ff64aaf2.png'
WHERE `students`.`id` IN ('2')
---
            $data['signature'] = $signatureName;
        }

        $studentModel->update($id, $data);